# EDA216 - Lecture 1

During the lectures and exercises we'll try out SQL-code in Jupyter
Notebooks, and to do that we begin by evaluating:

In [1]:
%load_ext sql

In [2]:
%sql sqlite://

'Connected: None@None'

Everything in the code sections is evaluated
as [Python](https://www.python.org/) code (more on that later), but
lines beginning with `%sql` will be seen as an SQL statement, and all
lines following `%%sql` will also be evaluated as SQL statements.

## Contacts

We first define a table to store our contacts:

In [3]:
%%sql
DROP TABLE IF exists contacts;
CREATE TABLE contacts (
  name             VARCHAR(32),
  phone            VARCHAR(16),
  email            VARCHAR(32)
);

INSERT INTO contacts (name, phone, email)
VALUES ('Adam', '650-043-1797', 'adam@life.edu'),
       ('Emma', '347-326-4813', 'emma@mail.org'),
       ('Christian', '347-326-3154', 'cs@gmail.com');

Done.
Done.
3 rows affected.

[]

We can see everything that's in the table using:

In [4]:
%%sql
SELECT * FROM contacts;

Done.

[('Adam', '650-043-1797', 'adam@life.edu'),
 ('Emma', '347-326-4813', 'emma@mail.org'),
 ('Christian', '347-326-3154', 'cs@gmail.com')]

### Exercises

Write SQL statements to do the following:

+  Show all names

In [1]:
%%sql
SELECT name
FROM contacts

ERROR:root:Cell magic `%%sql` not found.

Chosing just a few columns is called a *projection*.

+  Show all names, alphabetically

In [ ]:
%%sql

+  Show all phone numbers

In [ ]:
%%sql

+  Show Adam's phone number and email address

In [ ]:
%%sql

Chosing just a few rows is called a *selection*.

+  Show all phone numbers beginning with `347`

In [ ]:
%%sql

## Nobel laureates in literature

In [5]:
%sql sqlite:///nobel.db

'Connected: None@nobel.db'

To see the structure of a table, we can write:

In [6]:
%sql PRAGMA table_info(laureates);

Done.

[(0, 'year', 'INTEGER', 0, None, 0),
 (1, 'name', 'TEXT', 0, None, 0),
 (2, 'nationality', 'TEXT', 0, None, 0),
 (3, 'language', 'TEXT', 0, None, 0),
 (4, 'citation', 'TEXT', 0, None, 0),
 (5, 'genres', 'TEXT', 0, None, 0)]

We can also get a SQL statement which creates the table in question:

In [ ]:
%sql SELECT sql FROM sqlite_master WHERE name = <table name>;

This can sometimes be useful, I've put it here for reference.


### Exercises

+  Show the names of all the laureates

In [9]:
%%sql
SELECT name, year
FROM   laureates

Done.

[('Sully Prudhomme', 1901),
 ('Theodor Mommsen', 1902),
 ('Bjørnstjerne Bjørnson', 1903),
 ('Frédéric Mistral', 1904),
 ('José Echegaray', 1904),
 ('Henryk Sienkiewicz', 1905),
 ('Giosuè Carducci', 1906),
 ('Rudyard Kipling', 1907),
 ('Rudolf Christoph Eucken', 1908),
 ('Selma Lagerlöf', 1909),
 ('Paul von Heyse', 1910),
 ('Maurice Maeterlinck', 1911),
 ('Gerhart Hauptmann', 1912),
 ('Rabindranath Tagore', 1913),
 ('Not awarded', 1914),
 ('Romain Rolland', 1915),
 ('Verner von Heidenstam', 1916),
 ('Karl Adolph Gjellerup', 1917),
 ('Henrik Pontoppidan', 1917),
 ('Not awarded', 1918),
 ('Carl Spitteler', 1919),
 ('Knut Hamsun', 1920),
 ('Anatole France', 1921),
 ('Jacinto Benavente', 1922),
 ('William Butler Yeats', 1923),
 ('Władysław Reymont', 1924),
 ('George Bernard Shaw', 1925),
 ('Grazia Deledda', 1926),
 ('Henri Bergson', 1927),
 ('Sigrid Undset', 1928),
 ('Thomas Mann', 1929),
 ('Sinclair Lewis', 1930),
 ('Erik Axel Karlfeldt', 1931),
 ('John Galsworthy', 1932),
 ('Ivan Bunin', 1933),
 ('Luigi Pirandello', 1934),
 ('Not awarded', 1935),
 ("Eugene O'Neill", 1936),
 ('Roger Martin du Gard', 1937),
 ('Pearl S. Buck', 1938),
 ('Frans Eemil Sillanpää', 1939),
 ('Not awarded', 1940),
 ('Not awarded', 1941),
 ('Not awarded', 1942),
 ('Not awarded', 1943),
 ('Johannes Vilhelm Jensen', 1944),
 ('Gabriela Mistral', 1945),
 ('Hermann Hesse', 1946),
 ('André Gide', 1947),
 ('T. S. Eliot', 1948),
 ('William Faulkner', 1949),
 ('Bertrand Russell', 1950),
 ('Pär Lagerkvist', 1951),
 ('François Mauriac', 1952),
 ('Sir Winston Churchill', 1953),
 ('Ernest Hemingway', 1954),
 ('Halldór Laxness', 1955),
 ('Juan Ramón Jiménez', 1956),
 ('Albert Camus', 1957),
 ('Boris Pasternak', 1958),
 ('Salvatore Quasimodo', 1959),
 ('Saint-John Perse', 1960),
 ('Ivo Andrić', 1961),
 ('John Steinbeck', 1962),
 ('Giorgos Seferis', 1963),
 ('Jean-Paul Sartre', 1964),
 ('Mikhail Sholokhov', 1965),
 ('Shmuel Yosef Agnon', 1966),
 ('Nelly Sachs', 1966),
 ('Miguel Ángel Asturias', 1967),
 ('Yasunari Kawabata', 1968),
 ('Samuel Beckett', 1969),
 ('Aleksandr Solzhenitsyn', 1970),
 ('Pablo Neruda', 1971),
 ('Heinrich Böll', 1972),
 ('Patrick White', 1973),
 ('Eyvind Johnson', 1974),
 ('Harry Martinson', 1974),
 ('Eugenio Montale', 1975),
 ('Saul Bellow', 1976),
 ('Vicente Aleixandre', 1977),
 ('Isaac Bashevis Singer', 1978),
 ('Odysseas Elytis', 1979),
 ('Czesław Miłosz', 1980),
 ('Elias Canetti', 1981),
 ('Gabriel García Márquez', 1982),
 ('William Golding', 1983),
 ('Jaroslav Seifert', 1984),
 ('Claude Simon', 1985),
 ('Wole Soyinka', 1986),
 ('Joseph Brodsky', 1987),
 ('Naguib Mahfouz', 1988),
 ('Camilo José Cela', 1989),
 ('Octavio Paz', 1990),
 ('Nadine Gordimer', 1991),
 ('Derek Walcott', 1992),
 ('Toni Morrison', 1993),
 ('Kenzaburō Ōe', 1994),
 ('Seamus Heaney', 1995),
 ('Wisława Szymborska', 1996),
 ('Dario Fo', 1997),
 ('José Saramago', 1998),
 ('Günter Grass', 1999),
 ('Gao Xingjian', 2000),
 ('Sir V. S. Naipaul', 2001),
 ('Imre Kertész', 2002),
 ('J. M. Coetzee', 2003),
 ('Elfriede Jelinek', 2004),
 ('Harold Pinter', 2005),
 ('Orhan Pamuk', 2006),
 ('Doris Lessing', 2007),
 ('J. M. G. Le Clézio', 2008),
 ('Herta Müller', 2009),
 ('Mario Vargas Llosa', 2010),
 ('Tomas Tranströmer', 2011),
 ('Mo Yan', 2012),
 ('Alice Munro', 2013),
 ('Patrick Modiano', 2014),
 ('Svetlana Alexievich', 2015),
 ('Bob Dylan', 2016)]

+  When did Winston Churchill win his prize?

In [11]:
%%sql
SELECT year
FROM   laureates
WHERE  name LIKE '%Winston Churchill'

Done.

[(1953,)]

+ Why did Bob Dylan get the prize?

In [12]:
%%sql
SELECT citation
FROM   laureates
WHERE  name = 'Bob Dylan'

Done.

[('for having created new poetic expressions within the great American song tradition',)]

+  How many prizes has been awarded?

In [16]:
%%sql
SELECT year
FROM laureates
WHERE name = 'Not awarded'

Done.

[(1914,), (1918,), (1935,), (1940,), (1941,), (1942,), (1943,)]

+  How many prizes have been won by Swedish authors after 1920?

In [20]:
%%sql
SELECT year, name
FROM laureates
WHERE nationality = 'Sweden' 
      AND year > 1920
      AND name <> 'Harry Martinson'

Done.

[(1931, 'Erik Axel Karlfeldt'),
 (1951, 'Pär Lagerkvist'),
 (1974, 'Eyvind Johnson'),
 (2011, 'Tomas Tranströmer')]

Now return to the slides...


## More tables for our contacts

In [21]:
%%sql
DROP TABLE IF exists contacts;
CREATE TABLE contacts (
  id               INT PRIMARY KEY,
  name             VARCHAR(32) NOT NULL
);

DROP TABLE IF exists phone_numbers;
CREATE TABLE phone_numbers (
  id               INT REFERENCES contacts(id),
  phone            VARCHAR(16)
);

DROP TABLE IF exists email_addresses;
CREATE TABLE email_addresses (
  id               INT REFERENCES contacts(id),
  email            VARCHAR(32)
);

INSERT INTO contacts (id, name)
VALUES (101, 'Adam'),
       (102, 'Emma'),
       (103, 'Christian');

INSERT INTO phone_numbers (id, phone)
VALUES (102, '347-326-4813'),
       (103, '347-326-3154');

INSERT INTO email_addresses (id, email)
VALUES (101, 'adam@life.edu'),
       (102, 'emma@mail.org'),
       (103, 'cs@gmail.com'),
       (103, 'cso@work.com');

Done.
Done.
Done.
Done.
Done.
Done.
3 rows affected.
2 rows affected.
4 rows affected.

[]

Write SQL statements to do the following:

+ Show all names

In [23]:
%%sql
SELECT name
FROM   contacts
ORDER BY name

Done.

[('Adam',), ('Christian',), ('Emma',)]

+ Show Emma's phone number

In [29]:
%%sql
SELECT phone
FROM   phone_numbers p, contacts c
WHERE  name = 'Emma'
       AND c.id = p.id

Done.

[('347-326-4813',)]

+ Show Christian's email addresses

In [30]:
%%sql
SELECT email
FROM   email_addresses e, contacts c
WHERE  name = 'Christian'
       AND e.id = c.id

Done.

[('cs@gmail.com',), ('cso@work.com',)]

+ Show the name and email address of everyone with a phone number beginning
  with `347`

In [31]:
%%sql
SELECT name, email
FROM   contacts c, phone_numbers p, email_addresses e
WHERE  phone like '347%'
       AND p.id = c.id
       AND p.id = e.id

Done.

[('Emma', 'emma@mail.org'),
 ('Christian', 'cs@gmail.com'),
 ('Christian', 'cso@work.com')]

+ Show the name and phone number of everyone with an email ending with
  `.com`

In [34]:
%%sql
SELECT DISTINCT name, phone
FROM   contacts c, phone_numbers p, email_addresses e
WHERE  email LIKE '%.com'
       AND e.id = c.id

Done.

[('Christian', '347-326-4813'), ('Christian', '347-326-3154')]